test_inlet4/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
	// LeftandRight
	// {
	// 	type zeroGradient;
	// }
        // frontAndBack
        // {
        //         type zeroGradient;
        // }

  frontAndBack
    {
        type            empty;
    }

    leftAndRight
    {
        type            calculated;
        value           $internalField;
    }

    hot
    {
        type            calculated;
        value           $internalField;
    }

    cold
    {
        type            calculated;
        value           $internalField;
    }
    
    inlet
    {
        type            calculated;
        value           $internalField;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
        Baffle
        {
               type            calculated;
        value           $internalField;
        }

  
}

// ************************************************************************* //
