test_inlet4/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298.15;

boundaryField
{
    // frontAndBack
    // {
    //     type            empty;
    // }

    // leftAndRight
    // {
    //     type            zeroGradient;
    // }


      frontAndBack
    {
        type            empty;
    }

    leftAndRight
    {
        type            zeroGradient;
    }

    hot
    {
        type            fixedValue;
        value           uniform 333.15; // 40 degC
    }

    cold
    {
        type            fixedValue;
        value           uniform 298.15; // 25 degC
    }

    inlet
    {
        type            fixedValue;
	    value 		    uniform 298.15;
    }

    outlet
    {
        type            zeroGradient;
    }


    Baffle
    {
        type            zeroGradient;
    }


}

// ************************************************************************* //
