test_inlet4/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    // LeftandRight
    // {
    //     type            nutkWallFunction;
    //     value           uniform 0;
    // }
    // frontAndBack
    // {
    //     type            nutkWallFunction;
    //     value           uniform 0;
    // }

     frontAndBack
    {
        type            empty;
    }

    leftAndRight
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    hot
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    cold
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    inlet
    {
	    type            calculated;
        value           $internalField;
    }

    outlet
    {
        type            calculated;
        value           $internalField;
    }
    Baffle
    {
        type            nutkWallFunction;
        value           $internalField;
    }


}


// ************************************************************************* //
